Section 10: Regular Expressions/Section 10.tex
% Created 2021-08-03 Tue 20:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-08-03}
\title{Section 10\\\medskip
\large Regular Expressions}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 10},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Regular Expression Basics}
\label{sec:org7901a6f}

In this lesson, we will be working with pattern matching and regular expressions. Regular expressions allow you to specify a pattern of text to search for.

An example of a text pattern would be a phone number. 415-555-0000. In the US, this is the standard way of writing up phone numbers. If we had that same number but without the hyphens, we would not recognize it as a phone number.

\begin{verbatim}
def isPhoneNumber(text):
    if len(text) != 12:
        return False
    for i in range(0, 3):
        if not text[i].isdecimal():
            return False
    if text[3] != '-':
        return False
    for i in range(4, 7):
        if not text[i].isdecimal():
            return False
    if text[7] != '-':
        return False
    for i in range(8, 12):
        if not text[i].isdecimal():
            return False
    return True

print(isPhoneNumber("415-555-1234"))
print(isPhoneNumber("My Phone Number"))

\end{verbatim}

\begin{verbatim}
True
False
\end{verbatim}


That's a lot of code for a relatively simple task. If we want to find phone numbers in large strings, we'd need to write some more code.

\begin{verbatim}
def isPhoneNumber(text):
    if len(text) != 12:
        return False
    for i in range(0, 3):
        if not text[i].isdecimal():
            return False
    if text[3] != '-':
        return False
    for i in range(4, 7):
        if not text[i].isdecimal():
            return False
    if text[7] != '-':
        return False
    for i in range(8, 12):
        if not text[i].isdecimal():
            return False
    return True

print(isPhoneNumber("415-555-1234"))
print(isPhoneNumber("My Phone Number"))

message="Call me at 415-555-1011 tomorrow, or 415-555-9999 for my office line"

foundNuumber=False

for i in range(len(message)):
    chunk=message[i:i+12]
    if isPhoneNumber(chunk) == True:
        print("Phone number found")
        foundNumber=True
if not foundNumber:
    print("Could not find any phone numbers")

\end{verbatim}

\begin{verbatim}
True
False
Phone number found
Phone number found
\end{verbatim}

\subsection{The re Module}
\label{sec:org2546724}

We can write the previous code much faster using regular expressions.

\begin{verbatim}

import re

message="Call me at 415-555-1011 tomorrow, or 415-555-9999 for my office line"

phoneNumRegex=re.compile(r"\d\d\d-\d\d\d-\d\d\d\d")

mo=phoneNumRegex.search(message)

print(type(mo))
print(mo.group())

print(phoneNumRegex.findall(message))


\end{verbatim}

\begin{verbatim}
<class 're.Match'>
415-555-1011
['415-555-1011', '415-555-9999']
\end{verbatim}

\section{Regex Groups and the Pipe Character}
\label{sec:org86f14e2}

We can try some more of Python's more powerful pattern matching capabilities.

Let's say we want to seperate the area code from a phone number.


\begin{verbatim}

import re

phoneNumRegex = re.compile(r"\d\d\d-\d\d\d-\d\d\d\d")
mo=phoneNumRegex.search("My number is 415-555-4242")
print(mo.group())


\end{verbatim}

\begin{verbatim}
415-555-4242
\end{verbatim}

\subsection{Groups}
\label{sec:org997af89}

Let's say we only want the phone number or only the phone number portion of the number. We can do this sing parentheses to mark out groups in the string.

\begin{verbatim}

import re

phoneNumRegex = re.compile(r"(\d\d\d)-(\d\d\d-\d\d\d\d)")
mo=phoneNumRegex.search("My number is 415-555-4242")
print(mo.group())

print(mo.group(1))
print(mo.group(2))

\end{verbatim}

\begin{verbatim}
415-555-4242
415
555-4242
\end{verbatim}


The parentheses there can be useful syntax when we want to find specific parts of something. However, what can we do when we want to find literal parentheses? We would escape them using parentheses.

\begin{verbatim}

import re

phoneNumRegex = re.compile(r"\(\d\d\d\) \d\d\d-\d\d\d\d")
mo=phoneNumRegex.search("My number is (415) 555-4242")
print(mo.group())

\end{verbatim}

\begin{verbatim}
(415) 555-4242
\end{verbatim}

\subsection{Pipe Character |}
\label{sec:org7ca0222}

Pipes can be used to match one of several patterns as part of the regular expression.

Let's say we wanted to match any of the strings ``Batman'', ``Batmobile'', ``Batcopter'', or ``Batbat''


\begin{verbatim}

import re

batRegex = re.compile(r"Bat(man|mobile|copter|bat)")
mo=batRegex.search("Batmobile lost a wheel.")
print(mo.group())
print(mo.group(1))

\end{verbatim}

\begin{verbatim}
Batmobile
mobile
\end{verbatim}


If the search method can't find the regular expression pattern, it will return None. In that case, we can risk running into errors.
\end{document}
